[net]
batch=64
subdivisions=8
width=416
height=416
channels=3
momentum=0.9
decay=0.0005
angle=0
saturation = 1.5
exposure = 1.5
hue=.1

learning_rate=0.001
max_batches = 120000
policy=steps
steps=-1,100,80000,100000
scales=.1,10,.1,.1

[convolutional]
batch_normalize=1
filters=16
size=3
stride=1
pad=1
activation=leaky

[maxpool]
size=2
stride=2

[convolutional]
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=leaky

[maxpool]
size=2
stride=2

[convolutional]
batch_normalize=1
filters=64
size=3
stride=1
pad=1
activation=leaky

[maxpool]
size=2
stride=2

[convolutional]
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=leaky

[maxpool]
size=2
stride=2

[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=leaky

[maxpool]
size=2
stride=2

[convolutional]
batch_normalize=1
filters=512
size=3
stride=1
pad=1
activation=leaky

[maxpool]
size=2
stride=1

[convolutional]
batch_normalize=1
filters=1024
size=3
stride=1
pad=1
activation=leaky

###########

[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=1024
activation=leaky

[convolutional]
size=1
stride=1
pad=1
filters=450
activation=linear

[region]
#anchors = 0.738768,0.874946,  2.42204,2.65704,  4.30971,7.04493,  10.246,4.59428,  12.6868,11.8741
#anchors = 29.9,21.1,  255.4,169.7,  156.9,82.9,  77.0,46.4,  404.4,191.1
#anchors = 29.9,21.1,  255.4,169.7,  156.9,82.9,  77.0,46.4,  404.4,191.1,  195.0,123.3,  114.2,61.5,  250.1,103.5,  318.1,172.3,  47.7,34.5
#anchors = 14.9,10.6,  127.7,84.8,  78.4,41.5,  38.5,23.2,  202.2,95.5,  97.5,61.7,  57.1,30.7,  125.1,51.8,  159.0,86.2,  23.8,17.2
#anchors = 11.9,27.8,73.8,  101.8,223.8,11.3,  62.5,109.4,21.1,  30.7,61.1,36.5,  161.2,252.0,8.6,  77.7,162.7,15.0,  45.5,81.1,28.0,  99.7,136.6,16.8,  126.8,227.3,10.8,  19.0,45.4,47.0
#anchors = 29.9,21.1,55.9,  255.4,169.7,8.5,  156.9,82.9,16.0,  77.0,46.4,27.7,  404.4,191.1,6.5,  195.0,123.3,11.4,  114.2,61.5,21.3,  250.1,103.5,12.7,  318.1,172.3,8.2,  47.7,34.5,35.6
#anchors = 0.3,0.7,7.3,  2.7,6.0,1.1,  1.6,2.9,2.1,  0.8,1.6,3.6,  4.2,6.7,0.9,  2.0,4.3,1.5,  1.2,2.2,2.8,  2.6,3.6,1.7,  3.3,6.1,1.1,  0.5,1.2,4.6
#anchors = 0.3,0.7,7.3,12.5,    2.7,6.0,1.1,12.2,    1.6,2.9,2.1,10.0,    0.8,1.6,3.6,11.0,    4.2,6.7,0.9,11.5,     2.0,4.3,1.5,11.9,    1.2,2.2,2.8,10.4,    2.6,3.6,1.7,7.3,    3.3,6.1,1.1,10.9,    0.5,1.2,4.6,12.3
#anchors = 0.3,0.7,7.3,2.2,     2.7,6.0,1.1,4.0,     1.6,2.9,2.1,6.4,     0.8,1.6,3.6,4.7,     4.2,6.7,0.9,5.7,      2.0,4.3,1.5,4.5,     1.2,2.2,2.8,5.9,     2.6,3.6,1.7,9.8,    3.3,6.1,1.1,6.2,     0.5,1.2,4.6,2.4
#anchors = 0.3,0.7,7.3,6.0,6.8, 2.7,6.0,1.1,5.6,2.9, 1.6,2.9,2.1,5.3,6.8, 0.8,1.6,3.6,5.7,5.9, 4.2,6.7,0.9,4.4,4.3, 2.0,4.3,1.5,5.2,5.6, 1.2,2.2,2.8,5.3,6.7, 2.6,3.6,1.7,5.4,7.2, 3.3,6.1,1.1,5.2,5.5, 0.5,1.2,4.6,5.9,5.8
#anchors = 0.3,0.7,7.3,-1.1,0.7, 2.7,6.0,1.1,-1.8,-7.1, 1.6,2.9,2.1,-2.5,0.6, 0.8,1.6,3.6,-1.6,-1.1, 4.2,6.7,0.9,-4.3,-4.4, 2.0,4.3,1.5,-2.5,-1.8, 1.2,2.2,2.8,-2.5,0.4, 2.6,3.6,1.7,-2.1,1.3, 3.3,6.1,1.1,-2.6,-2.0, 0.5,1.2,4.6,-1.2,-1.5
#anchors  = 0.3,0.8,6.9,0.5, 2.7,6.1,1.1,-3.0, 1.7,3.0,2.0,0.2, 0.6,1.3,4.3,-0.2, 4.2,6.7,0.9,-2.1, 2.1,4.4,1.4,-0.5, 0.9,1.7,3.4,0.0, 3.3,6.0,1.1,-0.6, 2.6,3.7,1.6,0.1, 1.3,2.3,2.6,-0.0
anchors = 0.3,0.7,7.8,-1.4,2.0, 2.3,4.8,1.3,-2.6,-1.3, 0.7,1.6,3.4,-1.8,0.4, 3.5,6.6,1.0,-2.5,0.4, 1.6,3.7,1.6,-1.4,-0.3, 1.4,2.3,2.5,-3.2,1.1, 2.4,3.1,1.9,-2.1,-0.7, 0.9,2.1,2.7,-1.4,-0.6, 0.5,0.8,7.0,-1.8,5.2, 4.8,6.9,0.7,-5.5,-6.2, 2.9,5.3,1.2,-2.5,-3.1, 0.5,1.4,3.9,-0.6,-4.7, 1.2,1.7,3.3,-4.5,0.1, 1.2,2.9,2.0,-1.4,-1.4, 0.4,1.0,5.4,-1.0,-2.1, 1.1,1.3,4.1,-3.7,0.2, 4.3,6.5,0.8,-5.7,-5.5, 2.8,3.5,1.6,0.1,-1.9, 2.3,7.2,0.9,0.4,-12.9, 1.8,2.3,2.4,-2.3,1.8, 3.3,4.1,1.4,-1.7,-2.7, 0.6,0.9,5.9,-3.0,1.6, 2.0,4.7,1.4,-2.4,-2.1, 2.9,6.2,1.0,-1.5,-5.9, 0.6,1.7,3.3,-0.4,-5.5, 3.1,7.1,0.9,-1.2,-10.8, 2.6,4.5,1.4,-4.4,5.8, 1.9,3.8,1.6,-2.7,-0.4, 0.9,1.5,3.6,-2.3,2.5, 3.3,5.9,1.1,-3.4,1.0, 1.1,2.1,2.6,-2.7,6.2, 0.3,0.8,6.4,-0.5,-1.4, 0.9,1.1,4.9,-1.2,1.6, 1.8,5.4,1.2,-1.1,-9.7, 0.4,1.2,4.7,-0.7,-1.6, 1.8,4.3,1.5,-1.8,0.1, 0.7,2.1,2.7,-0.3,-8.9, 1.4,3.2,1.9,-2.1,-0.3, 1.6,2.1,2.7,-2.9,1.2, 4.4,8.2,0.8,-1.7,-4.0, 2.1,2.7,2.1,-3.8,-0.6, 2.2,3.8,1.6,-4.0,-0.6, 0.2,0.6,9.1,-0.9,0.6, 1.7,3.1,1.9,-1.8,-0.9, 3.9,4.1,1.3,0.2,0.5, 1.0,2.6,2.2,-1.0,-6.5, 2.5,5.4,1.2,-2.2,-8.6, 1.4,1.7,3.3,-1.5,1.8, 4.0,6.7,0.9,-4.3,-2.7, 0.7,1.2,4.6,-3.2,5.9
bias_match=1
classes=2
coords=4
num=10
softmax=1
jitter=.2
rescore=1
maxz=100

object_scale=5
noobject_scale=1
class_scale=1
coord_scale=1
dist_scale=1
alpha_scale=1

absolute=1
thresh = .3
random=1
json_path=data/kitti/set1/PNGImagesTest/out
annotation_path=data/kitti/set1/AnnotationsTest
